#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//int main()
//{
//	printf("hehe\n");
//	return 0;
//}

//模拟memcpy函数
//void* memcy(void* dst, const void* src, size_t count)
//{
//	void* ret = dst;
//	assert(dst);
//	assert(src);
//
//	while (count--)
//	{
//		*(char*)dst = *(char*)src;
//		dst = (char*)dst + 1;
//		src = (char*)src + 1;
//	}
//	return (ret);
//}

//模拟memmove函数
//void* memmove(void* dst, const void* src, size_t count)
//{
//	void* ret = dst;
//
//	if (dst <= src || (char*)dst >= ((char*)src + count))
//	{
//		while (count--)
//		{
//			*(char*)dst=*(char*)src;
//				dst = (char*)dst + 1;
//				src = (char*)src + 1;
//
//		}
//	}
//	else 
//	{
//		dst = (char*)dst + count - 1;
//		src = (char*)src + count - 1;
//
//		while (count--)
//		{
//			*(char*)dst = *(char*)src;
//			dst = (char*)dst - 1;
//			src = (char*)src - 1;
//		}
//	}
//	return (ret);
//}

#include<stdio.h>

//整数的二进制表述方式
//原码
//反码
//补码
//int main()
//{
//	int a = 20;
//	//0(符号位)
//	//0 000000000000000000000000000 10100 - 原码
//	//0 000000000000000000000000000 10100 - 反码
//	//0 000000000000000000000000000 10100 - 补码
//	int b = -10;
//	//1（符号位）
//	//1 0000000000000000000000000000 1010 - 原码
//	//1 1111111111111111111111111111 0101 - 反码 
//	//1 1111111111111111111111111111 0110 - 补码 
//	//内存中存储的都是二进制数据
//	//
//	return 0;
//}
//
//#include<stdio.h>
//int main()
//{
//	1 - 1;
//	1 + (-1);
//	//00000000000000000000000000000001  --   1的补码
//	//10000000000000000000000000000001  --  -1的原码
//	//11111111111111111111111111111110  --  -1的反码
//	//11111111111111111111111111111111  --  -1的补码
//	//补码相加
//	//00000000000000000000000000000001
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000 --   0
//	//使用原码计算
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	//10000000000000000000000000000010
//	//-2
//	return 0;
//}
//
//#include<stdio.h>
//int main()
//{
//	int a = 0x11223344;
//
//	return 0;
//}

//百度2015年系统工程师笔试题：
//请简述大端字节序和小端字节序的概念，设计一个小程序来判断当前机器的字节序。
//#include<stdio.h>
////如果是大端返回0
////如果是小端返回1
//int check_sys()
//{
//	int a = 1;
//	//访问一个字节
//	if ((char*)&a == 1)
//		return 1;
//	else
//		return 0;
//}
//
//int main()
//{
//	if (check_sys() == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	
//	return 0;
//}
//
//#include<stdio.h>
////如果是大端返回0
////如果是小端返回1
//int check_sys()
//{
//	int a = 1;
//	return *(char*) & a;
//}
//
//int main()
//{
//	if (check_sys() == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//
//	return 0;
//}

//输出什么？
//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111 --  char 截断
//	//整型提升（符号位）
//	//11111111111111111111111111111111
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001   -1
//	signed char b = -1;//（等价于 char a）
//	unsigned char c = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111
//	//unsigned无符号位，整型提升直接补0
//	//00000000000000000000000011111111
//	//255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}
//#include<stdio.h>
//
//int main()
//{
//	unsigned int num = -10;
//	printf("%d\n", num);
//	return = 0;
//}
#include <stdio.h>
int main()
{
	char a = 128;
	printf("%u\n", a);
	return 0;
}