#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <assert.h>

//int my_strlen(const char* str)
//{
//	int count = 0;
//	//assert(str != NULL);
//	assert(str);
//	//while (*str != '\0')
//	while (*str)
//	{
//		count++;
//		str++;
//	}
//	return count;
//}

//int my_strlen(const char* str)
//{
//	int count = 0;
//	assert(str);
//	while (*str)
//	{
//		count++;
//		str++;
//	}
//	return count;
//}
//
//
//int main()
//{
//	int len = my_strlen("abc");
//	printf("%d\n", len);
//	return 0;
//}
//
//

//int Add(int x, int y)
//{
//	return x + y;
//}

//int main()
//{
//	int a = 0;
//	printf("hehe\n");
//	int ret =Add(2, 3);
//
//	return 0;
//}

//
//ctrl+f -  搜索
//


//
//整数的二进制表示形式：
//原码
//反码
//补码
//
//int main()
//{
//	int a = 20;
//	//
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//	//00000014
//
//	int b = -10;
//	//
//	//10000000000000000000000000001010 - -10的原码
//	//11111111111111111111111111110101 - -10的反码
//	//11111111111111111111111111110110 - -10的补码
//	//FFFFFFF6
//	//内存中存储的都是二进制数据
//	//
//	return 0;
//}

//
//int main()
//{
//	1 - 1;
//	1 + (-1);
//	//使用原码计算
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	//10000000000000000000000000000010
//	//-2
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111 -1的补码
//	//00000000000000000000000000000001
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000
//	//
//	return 0;
//}
//
//
//int main()
//{
//	int a = 0x11223344;
//	
//	return 0;
//}
//

//int main()
//{
//	int a = 1;
//	char*p = (char*)&a;//int*
//	if (*p == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//
//	return 0;
//}

//如果是大端返回0
//如果是小端返回1
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;//int*
//	if (*p == 1)
//		return 1;//小端
//	else
//		return 0;//大端
//}

//int check_sys()
//{
//	int a = 1;
//	if (*(char*)&a == 1)
//		return 1;//小端
//	else
//		return 0;//大端
//}

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//
//int main()
//{
//	if (check_sys() == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}

//
//包教包会包婚配
//

//输出什么？
#include <stdio.h>
//
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111 - 截断
//	//整型提升
//	//11111111111111111111111111111111
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001 -1
//
//	signed char b = -1;
//	//-1
//
//	unsigned char c = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//00000000000000000000000011111111
//	//
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	
//	return 0;
//}

//int main()
//{
//	char a = 200;
//
//	return 0;
//}

//int main()
//{
//	unsigned int num = -10;
//	//10000000000000000000000000001010
//	//11111111111111111111111111110101
//	//11111111111111111111111111110110
//	//
//	printf("%d\n", num);
//	printf("%u\n", num);
//
//	return 0;
//}


#include <stdio.h>
int main()
{
	char a = 128;
	printf("%u\n", a);

	return 0;
}
